AccountingRegisters/Хозрасчетный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<AccountingRegister>
		<Properties>
			<Name>Хозрасчетный</Name>
			<Comment>(Регл)</Comment>
			<ChartOfAccounts>ChartOfAccounts.Хозрасчетный</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютнаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Валютный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Количественный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Количественный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоСЗ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.КоличественныйСЗ</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.КоличественныйСЗ</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЖурнала</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПервичныйДокумент</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

AccountingRegisters/Хозрасчетный/Ext/RecordSetModule.bsl
Процедура ПередЗаписью(Отказ, РежимЗаписи)
	
	// *Запрет
	Регистратор=ЭтотОбъект.Отбор.Регистратор.Значение;
	
	ТекстОшибки = ПроверкаПериодаЗаписей("РегистрБухгалтерии.Хозрасчетный",ЭтотОбъект.Выгрузить(),Регистратор, Отказ);
	
	Если Отказ Тогда
		Сообщить(ТекстОшибки);
		Возврат;
	КонецЕсли;
	
	Если Количество()>0 Тогда
		Заголовок = СокрЛП(ЭтотОбъект.Отбор.Регистратор.Значение);
	Иначе
		Возврат;
	КонецЕсли; 
	
	ПолныеПрава=ложь;
	
	ТекущийПользователь = ПользователиИнформационнойБазы.ТекущийПользователь();
	Для каждого РольПользователя Из ТекущийПользователь.Роли Цикл
		Если РольПользователя.Имя="ПолныеПрава" Тогда
			ПолныеПрава = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;


	НомерПроводки=0;
	
	Для Каждого Проводка Из ЭтотОбъект Цикл
		
		НомерПроводки=НомерПроводки+1;
		Если ЗначениеНеЗаполнено(Проводка.СчетДт) И не Проводка.СчетКт.Забалансовый Тогда
			СообщитьОбОшибке("Проводка № "+(НомерПроводки) +" <"+Проводка.Содержание+">: не заполнен счет дебета.",Отказ,Заголовок);
		КонецЕсли;
		Если ЗначениеНеЗаполнено(Проводка.СчетКт) И не Проводка.СчетДт.Забалансовый Тогда
			СообщитьОбОшибке("Проводка № "+(НомерПроводки) +" <"+Проводка.Содержание+">: не заполнен счет кредита.",Отказ,Заголовок);
		КонецЕсли;
		
		//Если Не ПолныеПрава Тогда
		//Если не НеПроверятьРегистратор(Типзнч(ЭтотОбъект.Отбор.регистратор.значение)) Тогда		
		//	Для н=1 По мин(Проводка.СчетДт.ВидыСубконто.Количество(),3) Цикл
		//		Если ЗначениеНеЗаполнено(ЗначениеСубконтоПоНомеру(н,Проводка.СчетДт,Проводка.СубконтоДт)) Тогда
		//			СообщитьОбОшибке("Проводка № "+(НомерПроводки) +" <"+Проводка.Содержание+">: не заполнено субконто № "+Строка(н)+".",Отказ,Заголовок);
		//		КонецЕсли; 
		//	КонецЦикла; 
		//	
		//	Для н=1 По мин(Проводка.СчетКт.ВидыСубконто.Количество(),3) Цикл
		//		Если ЗначениеНеЗаполнено(ЗначениеСубконтоПоНомеру(н,Проводка.СчетКт,Проводка.СубконтоКт)) Тогда
		//			СообщитьОбОшибке("Проводка № "+(НомерПроводки) +" <"+Проводка.Содержание+">: не заполнено субконто № "+Строка(н)+".",Отказ,Заголовок);
		//		КонецЕсли; 
		//	КонецЦикла; 
		//КонецЕсли;
		//КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ЗначениеСубконтоПоНомеру(НомерСубконто,Счет,НаборСубконто) Экспорт

   Если ЗначениеНеЗаполнено(Счет) Тогда
       Возврат Неопределено;
   КонецЕсли;
   
   ВидыСубконто = Счет.ВидыСубконто;
   
   Если НомерСубконто>ВидыСубконто.Количество() Тогда
       Возврат Неопределено;
   КонецЕсли;
   
   ВидСубконто = ВидыСубконто.Получить(НомерСубконто-1).ВидСубконто;
   
   Возврат НаборСубконто[ВидСубконто];

КонецФункции // ЗначениеСубконтоПоНомеру 

Функция НеПроверятьРегистратор(ТипРегистратора)
	
	Если ТипРегистратора=Тип("ДокументСсылка.СчетФактураНаОтгрузку") Тогда		
		Возврат истина;
	ИначеЕсли ТипРегистратора=Тип("ДокументСсылка.СчетФактураНаОтгрузкуВалютная") Тогда		
		Возврат истина;
	ИначеЕсли ТипРегистратора=Тип("ДокументСсылка.Закрытие23и25счета") Тогда		
		Возврат истина;
	ИначеЕсли ТипРегистратора=Тип("ДокументСсылка.ЗакрытиеПроизводства") Тогда		
		Возврат истина;
	ИначеЕсли ТипРегистратора=Тип("ДокументСсылка.ЗакрытиеМесяца") Тогда		
		Возврат истина;
	ИначеЕсли ТипРегистратора=Тип("ДокументСсылка.ЗакрытиеАвансовыхСчетов") Тогда		
		Возврат истина;
	ИначеЕсли ТипРегистратора=Тип("ДокументСсылка.ПереоценкаВалютныхСчетов") Тогда		
		Возврат истина;
	ИначеЕсли ТипРегистратора=Тип("ДокументСсылка.ПроводкиПоЗарплате") Тогда		
		Возврат истина;
	ИначеЕсли ТипРегистратора=Тип("ДокументСсылка.ПриходНоменклатурыВнутренний") Тогда		
		Возврат истина;
	ИначеЕсли ТипРегистратора=Тип("ДокументСсылка.ПринятиеКУчетуОС") Тогда		
		Возврат истина;
	КонецЕсли;
	
	Возврат ложь;
КонецФункции
